Reports/ВедомостьПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ВедомостьПоУслугам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ВедомостьПоУслугам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьОтчетНаСервере()
	Условие = "";
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(Отчет.ЛицевойСчет) Тогда
		Условие = "ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", Отчет.ЛицевойСчет);
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.Здание) Тогда
		Условие = Условие + " И ЛицевойСчет.Владелец = &Здание";
		Запрос.УстановитьПараметр("Здание", Отчет.Здание);
	КонецЕсли;
	Если Отчет.ЧасныйСектор = Истина Тогда
		Условие = Условие + " И ЛицевойСчет.Владелец.ЧастныйСектор = ИСТИНА И ЛицевойСчет.Владелец.МногоКвартирный = ЛОЖЬ";
	Иначе
		Условие = Условие + " И ЛицевойСчет.Владелец.ЧастныйСектор = ЛОЖЬ И ЛицевойСчет.Владелец.МногоКвартирный = ИСТИНА";
	КонецЕсли;
	
	
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет.Владелец,
	    |	НазначенныеУслугиСрезПоследних.Услуга
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(&НаДату, " + Условие + ") КАК НазначенныеУслугиСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Отчет.НаДату);
    Результат = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры
